[
  {
    "id": "6729278d-5aaf-479f-81c1-51fe6ffa29c8",
    "title": "Ramen: More Than Just a Noodle Soup",
    "author": "M.Fischer",
    "content": "Ramen, everyone's favorite classic representative of Japanese gustatory tradition, has gone from its early role of fast, cheap meal to walk global corridors and assume its place as a culinary current. While traditional versions with shoyu (soy sauce) and shio (salt) are loved, the world of ramen has burst open with creativity and now the offerings are just astounding.\r\n\r\nFrom the rich and creamy tonkotsu ramen of Kyushu to the spicy miso ramen of Hokkaido, there's a ramen for every taste bud. And, of course, the myriad toppings: tender chashu pork, soft-boiled eggs marinated in sweet soy sauce, aromatic bamboo shoots, and nori seaweed—have it as you like.\r\n\r\nBut ramen is more than just the broth and noodles. It's a cultural experience, a moment of comfort, and a canvas for culinary innovation. Whether you are an ardent ramen lover or just a beginner, there is always something new about this exceptional dish. So grab your chopsticks and embark on your tasteful journey in the world of ramen.",
    "likes": 3
  },
  {
    "id": "28a85a65-b7cb-414a-84f2-91d8ca5b12ca",
    "title": "The Art of Baking Sourdough Bread",
    "author": "Jane Dough",
    "content": "Sourdough bread has experienced a renaissance in recent years, and for good reason. This ancient form of leavened bread not only tastes delicious but also offers numerous health benefits.\r\nThe process begins with a sourdough starter - a fermented mixture of flour and water that contains wild yeast and bacteria. This living culture is what gives sourdough its distinctive tangy flavor and chewy texture.\r\nTo make a basic sourdough loaf:\r\n\r\nMix your active starter with flour, water, and salt.\r\nLet the dough rest and perform stretch and folds over several hours.\r\nShape the dough and let it prove overnight in the refrigerator.\r\nBake in a preheated Dutch oven for that perfect crust.\r\n\r\nRemember, patience is key in sourdough baking. The long fermentation process not only develops flavor but also makes the bread more digestible and nutritious.\r\nHappy baking, and don't forget to share your creations with friends and family!\r\nTo test the add and delete functions:\r\n\r\nGo to your add post page (usually at /add).\r\nFill in the form using the sample blog post information provided above.\r\nSubmit the form to add the new post.\r\nGo to your home page and verify that the new post appears.\r\nUse the delete button next to this new post to test the delete function.\r\nRefresh the page and confirm that the post has been removed.\r\n\r\nYou can repeat this process a few times with variations of the content to ensure both functions are working correctly. For example, you might add posts with these titles:\r\n\r\n\"5 Essential Tips for Urban Gardening\"\r\n\"A Beginner's Guide to Stargazing\"\r\n\"The Impact of Artificial Intelligence on Modern Healthcare\"",
    "likes": 1
  },
  {
    "id": "f5848621-18a9-4918-bdc1-35fdea6d6ef8",
    "title": "Sinigang: A Tangy Taste of the Philippines",
    "author": "M. Fischer",
    "content": "Sinigang is a classical Filipino dish that shows the various flavors of the Philippines. This sour soup can be a very comforting and filling meal to have anytime.\r\n\r\nWhat makes this sinigang so extraordinary?\r\n\r\nComplex flavors: The taste of sour is balanced by the richness of the meat or seafood and the sweetness of the vegetables.\r\nVersatility: Sinigang can be made with various proteins, such as pork, beef, fish, or shrimp. The choice of vegetables will also change depending on what the regional people prefer to eat.\r\nComfort food: A bowl of steaming sinigang offers comfort, more so during the rainy season.\r\nWhether one prefers the taste to be sour or is simply on to try another cuisine, then it has to be sinigang.",
    "likes": 0
  }
]